# Introduction to Pandas

In [1]:
#here we are importing pandas as pd for easy calling
import pandas as pd

In [3]:
# an empty series
data = pd.Series()

In [4]:
data

Series([], dtype: float64)

In [5]:
#creating a list of names
names = ['Tayo', 'Ade', 'Taiwo','Kehinde']

In [6]:
names_series = pd.Series(names)

In [7]:
#printing out the series lists of names in to table 
names_series

0       Tayo
1        Ade
2      Taiwo
3    Kehinde
dtype: object

In [9]:
#assigning the the index with alphabets
names_series = pd.Series(names, index=['a','b','c','d'])

In [10]:
#printing out the table with the assigned index
names_series

a       Tayo
b        Ade
c      Taiwo
d    Kehinde
dtype: object

In [11]:
#creating a dictionary
new_names = {'a':'kehinde','b':'Taiwo'}

In [12]:
names_dict = pd.Series(new_names)

In [14]:
names_dict

a    kehinde
b      Taiwo
dtype: object

In [15]:
#using DataFrame to create a table with multiple columns
dictionary = {'names':['Kehinde','Taiwo', 'Tayo'],
              'age':[23,43,10]}
data=pd.DataFrame(dictionary)

In [17]:
data

   age    names
0   23  Kehinde
1   43    Taiwo
2   10     Tayo

In [18]:
dictionary = {'names':['Kehinde','Taiwo', 'Tayo'],
              'age':[23,43,10]}
#manipulating the index
data=pd.DataFrame(dictionary,index=[1,2,3])

In [19]:
data

   age    names
1   23  Kehinde
2   43    Taiwo
3   10     Tayo

In [20]:
#accessing rows and columns

In [21]:
#accessing columns
data['names']

1    Kehinde
2      Taiwo
3       Tayo
Name: names, dtype: object

In [22]:
data['age']

1    23
2    43
3    10
Name: age, dtype: int64

In [24]:
#accessing multiple columns
data[['names','age']]

     names  age
1  Kehinde   23
2    Taiwo   43
3     Tayo   10

In [25]:
#accessing rows
#loc[] and iloc[]

In [26]:
data.loc[1]

age           23
names    Kehinde
Name: 1, dtype: object

In [27]:
data.iloc[2]

age        10
names    Tayo
Name: 3, dtype: object

In [28]:
data.loc[3]

age        10
names    Tayo
Name: 3, dtype: object

In [31]:
#datafram['new coulm'] = values(list,dict, ndarray)
# adding new columns using list memthod
data['Gender'] = ['male','female','male']

In [32]:
data

   age    names  Gender
1   23  Kehinde    male
2   43    Taiwo  female
3   10     Tayo    male

In [34]:
# adding new columns using dictionary memthod
data['level']={200,300,100}
data

   age    names  Gender  level
1   23  Kehinde    male    200
2   43    Taiwo  female    100
3   10     Tayo    male    300

In [35]:
#to delete a column: del .pop
#using the del method
del data['level']

In [36]:
data

   age    names  Gender
1   23  Kehinde    male
2   43    Taiwo  female
3   10     Tayo    male

In [41]:
#using the .pop method
#it will remove the column and print out the column deleted

data.pop('age')

KeyError: 'age'

In [42]:
data

     names  Gender
1  Kehinde    male
2    Taiwo  female
3     Tayo    male

In [45]:
#deleting a row: .drop()
data=data.drop(3)

In [46]:
data

     names  Gender
1  Kehinde    male
2    Taiwo  female

In [48]:
# To import an existind data
# using dataset = pd.read_csv()
# pd.read_csv(): this is used for printing a .csv file
# note: to import any extenal file you have to move the from form it's location to your root system folder 
# i.e copy or move it, go to your local disk or drive c, open your user folder, tthen open your system name folder e.g john and past your file
# you can now have access to import it comfortably 

dataset = pd.read_csv('nfl_data.csv')

In [50]:
# printing all the title head present on our dataset
dataset.columns

Index(['Unnamed: 0', 'Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.',
       'First NFL Season', 'Division'],
      dtype='object')

In [51]:
#printing the whole data set
dataset

,Unnamed: 0,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
6,6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North
7,7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East
8,8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
9,9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West

In [52]:
#to get thelists of columns

dataset.columns

Index(['Unnamed: 0', 'Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.',
       'First NFL Season', 'Division'],
      dtype='object')

In [54]:
#to access the team colum

dataset.Team

0             Dallas Cowboys
1          Green Bay Packers
2              Chicago Bears
3             Miami Dolphins
4    New England Patriots[b]
5          Minnesota Vikings
6           Baltimore Ravens
7            New York Giants
8             Denver Broncos
9        San Francisco 49ers
Name: Team, dtype: object

In [55]:
#using -pop function to delete the column
dataset.pop('Unnamed: 0')

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: Unnamed: 0, dtype: int64

In [56]:
dataset

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North
7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East
8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West

In [57]:
#you can also use dataset.drop('name of clounm': axis=1)

In [58]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
Rank                10 non-null int64
Team                10 non-null object
GP                  10 non-null object
Won                 10 non-null int64
Lost                10 non-null int64
Tied                10 non-null int64
Pct.                10 non-null float64
First NFL Season    10 non-null int64
Division            10 non-null object
dtypes: float64(1), int64(5), object(3)
memory usage: 800.0+ bytes

In [59]:
#to print out the number of times each values appeared 
dataset.Team.value_counts()

Miami Dolphins             1
Chicago Bears              1
San Francisco 49ers        1
Denver Broncos             1
New York Giants            1
Baltimore Ravens           1
Green Bay Packers          1
Minnesota Vikings          1
New England Patriots[b]    1
Dallas Cowboys             1
Name: Team, dtype: int64

In [60]:
dataset.Division.value_counts()

NFC North    3
AFC East     2
NFC East     2
NFC West     1
AFC West     1
AFC North    1
Name: Division, dtype: int64

In [61]:
#to print out the unique values
dataset['Division'].unique()

array(['NFC East', 'NFC North', 'AFC East', 'AFC North', 'AFC West',
       'NFC West'], dtype=object)

In [62]:
dataset['Division'].loc[0]

'NFC East'

In [64]:
#to print out the first five values
#then if you pass in a speccific value in the bracket, it prints out the sets of the passes in values
dataset.head()

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [65]:
#e.g
dataset.head(7)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North

In [67]:
#to get the mean value of a column
dataset['GP'].mean

<bound method Series.mean of 0      882
1    1,336
2    1,370
3      800
4      884
5      870
6      352
7    1,305
8      884
9    1,002
Name: GP, dtype: object>

In [68]:
#to print the mean value for each numeric columns
dataset.mean()

Rank                   5.5000
Won                  526.7000
Lost                 425.2000
Tied                  16.6000
Pct.                   0.5514
First NFL Season    1951.9000
dtype: float64

In [69]:
dataset.mean

<bound method DataFrame.mean of    Rank                     Team     GP  Won  Lost  Tied   Pct.  \
0     1           Dallas Cowboys    882  502   374     6  0.573
1     2        Green Bay Packers  1,336  737   562    37  0.565
2     3            Chicago Bears  1,370  749   579    42  0.562
3     4           Miami Dolphins    800  445   351     4  0.559
4     5  New England Patriots[b]    884  489   386     9  0.558
5     6        Minnesota Vikings    870  470   390    10  0.546
6     7         Baltimore Ravens    352  190   161     1  0.541
7     8          New York Giants  1,305  687   585    33  0.539
8     9           Denver Broncos    884  470   404    10  0.537
9    10      San Francisco 49ers  1,002  528   460    14  0.534

   First NFL Season   Division
0              1960   NFC East
1              1921  NFC North
2              1920  NFC North
3              1966   AFC East
4              1960   AFC East
5              1961  NFC North
6              1996  AFC North
7              1925   NFC East
8              1960   AFC West
9              1950   NFC West  >

In [70]:
dataset.describe()

           Rank         Won       Lost       Tied       Pct.  First NFL Season
count  10.00000   10.000000   10.00000  10.000000  10.000000         10.000000
mean    5.50000  526.700000  425.20000  16.600000   0.551400       1951.900000
std     3.02765  165.946477  129.21541  14.893697   0.013607         23.858146
min     1.00000  190.000000  161.00000   1.000000   0.534000       1920.000000
25%     3.25000  470.000000  377.00000   6.750000   0.539500       1931.250000
50%     5.50000  495.500000  397.00000  10.000000   0.552000       1960.000000
75%     7.75000  647.250000  536.50000  28.250000   0.561250       1960.750000
max    10.00000  749.000000  585.00000  42.000000   0.573000       1996.000000

In [71]:
#to print the first five rows in the table
dataset.head()

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [73]:
#to print out a new data frame from the existing data frame
new_data=dataset[['Team', 'First NFL Season','Division']]

In [74]:
new_data

                      Team  First NFL Season   Division
0           Dallas Cowboys              1960   NFC East
1        Green Bay Packers              1921  NFC North
2            Chicago Bears              1920  NFC North
3           Miami Dolphins              1966   AFC East
4  New England Patriots[b]              1960   AFC East
5        Minnesota Vikings              1961  NFC North
6         Baltimore Ravens              1996  AFC North
7          New York Giants              1925   NFC East
8           Denver Broncos              1960   AFC West
9      San Francisco 49ers              1950   NFC West

In [76]:
dataset

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North
7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East
8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West

In [77]:
#here we added a new column and we are trying to fill the first 3 rows in the column with this 3 values
new_data['stadium']=pd.Series(['Maracana','Lico','Nurudeen'])

C:\Users\HABEEB\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [78]:
new_data

                      Team  First NFL Season   Division   stadium
0           Dallas Cowboys              1960   NFC East  Maracana
1        Green Bay Packers              1921  NFC North      Lico
2            Chicago Bears              1920  NFC North  Nurudeen
3           Miami Dolphins              1966   AFC East       NaN
4  New England Patriots[b]              1960   AFC East       NaN
5        Minnesota Vikings              1961  NFC North       NaN
6         Baltimore Ravens              1996  AFC North       NaN
7          New York Giants              1925   NFC East       NaN
8           Denver Broncos              1960   AFC West       NaN
9      San Francisco 49ers              1950   NFC West       NaN

In [79]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Team                10 non-null object
First NFL Season    10 non-null int64
Division            10 non-null object
stadium             3 non-null object
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

In [81]:
#to know the null set, this will print out the null sets as true and the non-null as false
new_data.isnull()

    Team  First NFL Season  Division  stadium
0  False             False     False    False
1  False             False     False    False
2  False             False     False    False
3  False             False     False     True
4  False             False     False     True
5  False             False     False     True
6  False             False     False     True
7  False             False     False     True
8  False             False     False     True
9  False             False     False     True

In [82]:
#cleaning or filling the missing values
#this will fill the whole empty spaces the value supplied

new_data.fillna(10, inplace=True)

C:\Users\HABEEB\Anaconda3\lib\site-packages\pandas\core\frame.py:2852: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  downcast=downcast, **kwargs)

In [83]:
new_data

                      Team  First NFL Season   Division   stadium
0           Dallas Cowboys              1960   NFC East  Maracana
1        Green Bay Packers              1921  NFC North      Lico
2            Chicago Bears              1920  NFC North  Nurudeen
3           Miami Dolphins              1966   AFC East        10
4  New England Patriots[b]              1960   AFC East        10
5        Minnesota Vikings              1961  NFC North        10
6         Baltimore Ravens              1996  AFC North        10
7          New York Giants              1925   NFC East        10
8           Denver Broncos              1960   AFC West        10
9      San Francisco 49ers              1950   NFC West        10

In [85]:
new_data.dropna(axis=0)

                      Team  First NFL Season   Division   stadium
0           Dallas Cowboys              1960   NFC East  Maracana
1        Green Bay Packers              1921  NFC North      Lico
2            Chicago Bears              1920  NFC North  Nurudeen
3           Miami Dolphins              1966   AFC East        10
4  New England Patriots[b]              1960   AFC East        10
5        Minnesota Vikings              1961  NFC North        10
6         Baltimore Ravens              1996  AFC North        10
7          New York Giants              1925   NFC East        10
8           Denver Broncos              1960   AFC West        10
9      San Francisco 49ers              1950   NFC West        10